None
Лучшая оценка теста: 7.49647571182251
Лучшая оценка точности модели: 0.050999999046325684
--------------------------------------------------------------------
====================================================================
None
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              9768960   
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 512)               2097664   
_________________________________________________________________
activation_2 (Activation)    (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 3323)              1704699   
_________________________________________________________________
activation_3 (Activation)    (None, 3323)              0         
=================================================================
Total params: 13,571,323
Trainable params: 13,571,323
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 7.739422668457031
Лучшая оценка точности модели: 0.07800000160932541
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              9768960   
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1024)              4195328   
_________________________________________________________________
activation_2 (Activation)    (None, 1024)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 4096)              4198400   
_________________________________________________________________
activation_3 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 3323)              13614331  
_________________________________________________________________
activation_4 (Activation)    (None, 3323)              0         
=================================================================
Total params: 31,777,019
Trainable params: 31,777,019
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 14.196938995361329
Лучшая оценка точности модели: 0.050999999046325684
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              9768960   
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 2048)              8390656   
_________________________________________________________________
activation_2 (Activation)    (None, 2048)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 4096)              8392704   
_________________________________________________________________
activation_3 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 3323)              13614331  
_________________________________________________________________
activation_4 (Activation)    (None, 3323)              0         
=================================================================
Total params: 40,166,651
Trainable params: 40,166,651
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 13.652148452758789
Лучшая оценка точности модели: 0.057999998331069946
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              9768960   
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3072)              12585984  
_________________________________________________________________
activation_2 (Activation)    (None, 3072)              0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 3072)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 3323)              10211579  
_________________________________________________________________
activation_3 (Activation)    (None, 3323)              0         
=================================================================
Total params: 32,566,523
Trainable params: 32,566,523
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 11.935354888916015
Лучшая оценка точности модели: 0.07900000363588333
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              9768960   
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3323)              13614331  
_________________________________________________________________
activation_2 (Activation)    (None, 3323)              0         
=================================================================
Total params: 23,383,291
Trainable params: 23,383,291
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 8.699709922790527
Лучшая оценка точности модели: 0.12099999934434891
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              9768960   
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3323)              13614331  
_________________________________________________________________
activation_2 (Activation)    (None, 3323)              0         
=================================================================
Total params: 23,383,291
Trainable params: 23,383,291
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 8.018266906738281
Лучшая оценка точности модели: 0.11699999868869781
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 6144)              14653440  
_________________________________________________________________
activation_1 (Activation)    (None, 6144)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3323)              20419835  
_________________________________________________________________
activation_2 (Activation)    (None, 3323)              0         
=================================================================
Total params: 35,073,275
Trainable params: 35,073,275
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 8.11660319519043
Лучшая оценка точности модели: 0.11299999803304672
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              19537920  
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3323)              13614331  
_________________________________________________________________
activation_2 (Activation)    (None, 3323)              0         
=================================================================
Total params: 33,152,251
Trainable params: 33,152,251
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 7.774726531982422
Лучшая оценка точности модели: 0.13099999725818634
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              19537920  
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3323)              13614331  
_________________________________________________________________
activation_2 (Activation)    (None, 3323)              0         
=================================================================
Total params: 33,152,251
Trainable params: 33,152,251
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 7.598812286376953
Лучшая оценка точности модели: 0.12300000339746475
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              19537920  
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3323)              13614331  
_________________________________________________________________
activation_2 (Activation)    (None, 3323)              0         
=================================================================
Total params: 33,152,251
Trainable params: 33,152,251
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 7.706505699157715
Лучшая оценка точности модели: 0.13099999725818634
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              19537920  
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3323)              13614331  
_________________________________________________________________
activation_2 (Activation)    (None, 3323)              0         
=================================================================
Total params: 33,152,251
Trainable params: 33,152,251
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 7.701631202697754
Лучшая оценка точности модели: 0.14000000059604645
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              19537920  
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3323)              13614331  
_________________________________________________________________
activation_2 (Activation)    (None, 3323)              0         
=================================================================
Total params: 33,152,251
Trainable params: 33,152,251
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 7.695051498413086
Лучшая оценка точности модели: 0.1289999932050705
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 3584)              21371392  
_________________________________________________________________
activation_1 (Activation)    (None, 3584)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 3584)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 3323)              11912955  
_________________________________________________________________
activation_2 (Activation)    (None, 3323)              0         
=================================================================
Total params: 33,284,347
Trainable params: 33,284,347
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 7.543935035705567
Лучшая оценка точности модели: 0.13600000739097595
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 4096)              30945280  
_________________________________________________________________
activation_1 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 33)                135201    
_________________________________________________________________
activation_2 (Activation)    (None, 33)                0         
=================================================================
Total params: 31,080,481
Trainable params: 31,080,481
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 1.626070598267488
Лучшая оценка точности модели: 0.6452051997184753
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 5120)              38681600  
_________________________________________________________________
activation_1 (Activation)    (None, 5120)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 5120)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 33)                168993    
_________________________________________________________________
activation_2 (Activation)    (None, 33)                0         
=================================================================
Total params: 38,850,593
Trainable params: 38,850,593
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 1.6228079845013474
Лучшая оценка точности модели: 0.6435579657554626
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 5324)              40222820  
_________________________________________________________________
activation_1 (Activation)    (None, 5324)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 5324)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 33)                175725    
_________________________________________________________________
activation_2 (Activation)    (None, 33)                0         
=================================================================
Total params: 40,398,545
Trainable params: 40,398,545
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 2.178879068786477
Лучшая оценка точности модели: 0.6235049962997437
--------------------------------------------------------------------
====================================================================
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 5120)              38681600  
_________________________________________________________________
activation_1 (Activation)    (None, 5120)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 5120)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 33)                168993    
_________________________________________________________________
activation_2 (Activation)    (None, 33)                0         
=================================================================
Total params: 38,850,593
Trainable params: 38,850,593
Non-trainable params: 0
_________________________________________________________________
Лучшая оценка теста: 3.516236360729324
Лучшая оценка точности модели: 0.6418715715408325
--------------------------------------------------------------------
====================================================================
